Revit 2022 API
IndependentTag.LeaderElbow Property
 The position of the elbow of the tag's leader.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetLeaderElbow(Reference)` or `SetLeaderElbow(Reference)` method instead.")]
public XYZ LeaderElbow { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetLeaderElbow(Reference)` or `SetLeaderElbow(Reference)` method instead.")> _
Public Property LeaderElbow As XYZ
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetLeaderElbow(Reference)` or `SetLeaderElbow(Reference)` method instead.")]
public:
property XYZ^ LeaderElbow {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 Straight leaders do not have elbow points.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The tag does not have a leader or its leader is straight. -or- When setting this property: The tag does not have a leader.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace